// Section5.js
import React from "react";
import Section1Image from "./images/Section1Image.png"; // Update the path to the image
import "./Section5.css";

const Section5 = () => {
  const contractNumber = "xxxx"; // Replace with the actual contract number
  return (
    <div className="section1">
      <div className="center-content">
        <img src={Section1Image} alt="dnaneer" className="image-style" />
        <p className="contract-number">{contractNumber}: رقم الاتفاقية</p>
        <div className="center-align">
          <p className="centered-text"> : المادة الثالثة: الاتفاقية </p>
          <p className="additional-text1">
            وفقًا لهذه االتفاقية، يُخوِّل "الطرف الثاني " أو "المستثمر" - بصفته
            وكيل - "الطرف األول" أو "الشركة" باستثمار مبلغ ٍ محدد في فرصة
            استثمارية مُحَددة، نيابة عن المستثمر ولصالحه والا يتعارض ذلك مع
            أحكام وشر وط الشر يعة االسالمية. يُمنَح الطرف األول بصفته وكيالا
            لجميع حقوق وسلطات المستثمر ذات العالقة، باإلضافة إىل قدْرتِه عىل
            تحصيل مبلغ االستثمار من "المقيض" أو "العميل"، ورفع الدعاوى نيابةعنه.
            كما يأذَن الطرف الثاني للطرف األول بهذه التخويالت لضمان
            استيفاءالتزامات المستثمرفي هذه االتفاقية.."
          </p>
          <p className="centered-text">
            {" "}
            : المادة الرابعة: إدارة النشاط الاستثماري
          </p>
          <p
            className="additional-text11"
            style={{ marginTop: "1cm" }} // Add inline style for margin-top
          >
            اتفق الطرفان على تحديد نشاط الاستثمار في عمليات التمويل من خلال
            المنصة الإلكترونية للشركة، وذلك في أي فرصة استثمارية معيَّنة يحددها
            العميل. يتضمَّن هذا التحديد قيام الوكيل بشراء سلعٍ وبيعها
            بالآجِــــــْل، مُرابِحَة لِصالِح المشتري.
          </p>
          <p className="additional-text11">
            {" "}
            يتعهد الطرف الأول الى الطرف الثاني وفقًا لهذه الاتفاقية، بإدارة مبلغ
            الاستثمار بالكفاءة والعناية المطلوبَتيْن. كما يتعهد بالإشراف على
            إجراءات سياسات الائتمان المُعْتَمَدَة في الشِّرْكة.
          </p>
          <p className="additional-text11">
            يحتفظ "الطرف الاول" أو "الوكيل" بالحرية المطلقة في اتخاذ الإجراءات
            اللازمة للاستثمار، دون الرجوع إلى "الطرف الثاني" أو "المكلِّف"،
            ويشمل ذلك توقيع العقود والتفاوض مع أطراف ثالثة، ودفع قيمة عمليات
            الاستثمار وأية مصاريفٍ تُطْبَق على هذه العمليات. كذلك يُخصِّص صلاحية
            التحصيل والدفع لصالح المستثمر من خلال استثمار أمواله. يُسَنِّد جزء
            أو كافة صلاحياته إلى شخص آخر حسب تقديره في حال دعت الضروف لذلك.
          </p>
          <p className="additional-text11">
            توصَّل الطرفان إلى اتفاقٍ ينص على أنَّ "الطرف الثاني" أو "المستثمر"
            ليس لديه حق مراجعة "الوكيل" أو "الشركة" والاجبار على أداء بعض
            الأعمال، كما لا يحق له طلب الموافقة من الوكيل قبل اتخاذ بعض
            الاجراءات. كما يُحظَر على "الطرف الثاني" أو "المستثمر" رفع دعوى
            قضائية، أو تنظيم إجراءات أخرى دون الرجوع الى "الوكيل" أو "الشركة".
          </p>
          <div
            className="additional-text"
            style={{ marginTop: "2cm" }} // Add inline style for margin-top
          >
            <p>
              شركة دنانير للتمويل سجل تجاري رقم1010621840والرقم
              املوحد7016651718، وهي شركة مرخصة من قبل البنك املركزي السعودي برأس
              مال خمسة ماليين ريال (5,000,000)، وعنونها ،الوطني الرياض
            </p>
            <p className="additional-text p">Riyadh, Saudi Arabia,</p>
            <p className="additional-text p">www.dnaneer.com</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Section5;
